CatApi/app/controllers/cats_controller.rb

    def index
        # GET /cats
        @cats = Cat.all
---
SELECT "cats".* FROM "cats"

    def show
        # GET /cats/123
        @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        # POST /cats
        # Content-Length: ...
        #
        # { "cat": { "name": "Sally" } }

        @cat = Cat.new(cat_params)

        if @cat.save
---
INSERT INTO "cats" ("name", "created_at", "updated_at", "skill", "coat_color", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Markov"], ["created_at", "2020-08-05 23:13:14.250251"], ["updated_at", "2020-08-05 23:13:14.250251"], ["skill", "Sleeping"], ["coat_color", "black"], ["description", "refeaf"]]

    def update
        @cat = Cat.find(params[:id])
        # If I upload an admin attribute, this tries to set cat.admin
        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "The finest cat ever!"], ["updated_at", "2020-08-05 23:14:27.629126"], ["id", 1]]

    def edit
        # /cats/:id/edit
        # show a form to edit an existing object
        @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

    def destroy
        # DELETE /cats/:id
        cat = Cat.find(params[:id])
        cat.destroy
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 12]]