CatApi/app/controllers/toys_controller.rb

    def index
        # /cats/:cat_id/toys
        cat = Cat.find(params[:cat_id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def show
        # /toys/:id
        render json: Toy.find(self.params[:id])
---
SELECT  "toys".* FROM "toys" WHERE "toys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        # POST /toys

        # Strong Parameters
        # self.params => Parameters < HashWithIndifferentAccess < Hash
        @toy = Toy.new(self.toy_params)
        @cat = @toy.cat

        if @toy.save
---
INSERT INTO "toys" ("cat_id", "name", "ttype", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 10], ["name", "Big Ball"], ["ttype", "yarnball"], ["created_at", "2020-07-29 12:58:54.059024"], ["updated_at", "2020-07-29 12:58:54.059024"]]

    def new
        @cat = Cat.find(params[:cat_id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def destroy
        # /toys/:id => It doesn't change
        toy = Toy.find(params[:id])
---
SELECT  "toys".* FROM "toys" WHERE "toys"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def update
        # /toys/:id => It doesn't change
        toy = Toy.find(params[:id])

        success = toy.update(self.toy_params)
---
SELECT  "toys".* FROM "toys" WHERE "toys"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "toys" SET "name" = $1, "updated_at" = $2 WHERE "toys"."id" = $3  [["name", "Senator String"], ["updated_at", "2020-07-28 20:14:11.488127"], ["id", 2]]