CatApi/app/controllers/toys_controller.rb

SELECT "toys".* FROM "toys"
---
    def index
        render json: Toy.all

UPDATE "toys" SET "name" = $1, "updated_at" = $2 WHERE "toys"."id" = $3  [["name", "Read Admiral String"], ["updated_at", "2020-07-28 20:35:45.326236"], ["id", 2]]
---
    def update
        toy = Toy.find(params[:id])

        success = toy.update(self.toy_params)