Library/app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @book = Book.find_by(id: params[:id])

INSERT INTO "books" ("title", "author", "year", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @book = Book.new(book_params)
        # params = { book: { title: 'HP', } }
        # params = { user: { name: 'claire', admin: true } }

        if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def edit
        @book = Book.find_by(id: params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "books" SET "year" = $1, "description" = $2, "updated_at" = $3 WHERE "books"."id" = $4
---
    def update
        @book = Book.find_by(id: params[:id])

        if @book.update_attributes(book_params)